// Term.jsx
import React from "react";
import "./term.scss"; // Import CSS file for styling

function term() {
  return (
    <div className="term">
      <div className="section">
        <h1>شروط الاستخدام</h1>
        <p>
          مرحبًا بك في موقع ويبنا. من خلال استخدام هذا الموقع، فإنك توافق على
          هذه الشروط والأحكام بالكامل. يجب أن تكون موافقًا على هذه الشروط
          والأحكام لاستخدام الموقع.
        </p>
        <h2>1. المسؤولية</h2>
        <p>
          نحن لسنا مسؤولين عن دقة المعلومات المتاحة على الموقع، ونحن لسنا
          مسؤولين عن أي خسائر أو ضرر قد ينجم عن استخدام المعلومات من قبل
          المستخدمين.
        </p>
        <h2>2. استخدام الموقع</h2>
        <p>
          يجب أن يكون استخدام الموقع لأغراض شخصية فقط. يجب على المستخدمين
          عدم استخدام الموقع بطريقة تنتهك القوانين المحلية أو الدولية.
        </p>
        <h2>3. حقوق النشر</h2>
        <p>
          بموجب هذه الشروط والأحكام، فإن المستخدمين يوافقون على عدم نسخ أو
          نقل أو تعديل أو توزيع أي جزء من المحتوى المتاح على الموقع بدون
          إذن خطي مسبق.
        </p>
      </div>
      <div className="section">
        <h1>سياسة الخصوصية</h1>
        <p>
          نحن نحترم خصوصيتك ونحن ملتزمون بحمايتها أثناء استخدامك لموقعنا
          الإلكتروني. تحتوي هذه السياسة على توضيح حول كيفية جمعنا واستخدامنا
          للمعلومات الشخصية.
        </p>
        <h2>1. جمع المعلومات</h2>
        <p>
          نقوم بجمع المعلومات الشخصية التي تقدمها لنا عند التسجيل أو عند نشر
          الإعلانات على الموقع.
        </p>
        <h2>2. استخدام المعلومات</h2>
        <p>
          نحن نستخدم المعلومات الشخصية لتوفير الخدمات المطلوبة ولتحسين تجربة
          المستخدم على الموقع.
        </p>
        <h2>3. مشاركة المعلومات</h2>
        <p>
          نحن لا نشارك المعلومات الشخصية مع أطراف خارجية دون موافقتك الصريحة،
          إلا في الحالات التي تقتضيها القوانين المحلية.
        </p>
      </div>
    </div>
  );
}

export default term;
